app/Controllers/CustomerAccounts.php

SELECT *
FROM `customers`
---
    public function index()
    {
        $customerModel = new CustomerModel();

        $data['customers'] = $customerModel->findAll();