app/Controllers/UserAccounts.php

    public function index()
    {
        $userModel = new UserModel();

        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`